Sprint_3/InitialProject/Project_2-master/app/Http/Controllers/FundController.php

    public function getFundsCategory($fund_type_id)
    {
        $categories = DB::table('funds_category')
            ->where('fund_type_id', $fund_type_id)
            ->select('id', 'name')
            ->get();
---
select `id`, `name` from `funds_category` where `fund_type_id` = '1'

    public function index()
    {
        if (auth()->user()->HasRole('admin')) {
            $funds = Fund::with(['category', 'fundType'])->latest()->get();
---
select * from `funds` order by `created_at` desc

    public function create()
    {
        $fundType = DB::table('funds_type')->get();
        $fundCategory = DB::table('funds_category')->get();
---
select * from `funds_type`
select * from `funds_category`

    public function store(Request $request)
    {
        // 1. Validate the request
        $request->validate([
            'funds_type_id' => 'required',
            'fund_cate' => 'required',
            'fund_name' => 'required',
            'support_resource' => 'required',
        ], [
            'funds_type_id.required' => 'กรุณาเลือกประเภททุนวิจัย',
            'fund_cate.required' => 'กรุณาเลือกลักษณะทุน',
            'fund_name.required' => 'กรุณากรอกชื่อทุน',
            'support_resource.required' => 'กรุณากรอกหน่วยงานที่สนับสนุน'
        ]);

        // 2. Create new fund with user_id
        Fund::create([
            'fund_name' => $request->fund_name,
            'fund_cate' => $request->fund_cate,
            'support_resource' => $request->support_resource,
            'user_id' => auth()->id(), // เพิ่ม user_id ของผู้ใช้ที่กำลังสร้างข้อมูล
        ]);
---
insert into `funds` (`fund_name`, `fund_cate`, `support_resource`, `user_id`, `updated_at`, `created_at`) values ('ff', '20', 'ff', 1, '2025-03-10 01:45:08', '2025-03-10 01:45:08')

    public function show($id)
{
    try {
        // Load fund with all necessary relationships
        $fund = Fund::with(['category.fundType', 'user'])->findOrFail($id);
---
select * from `funds` where `funds`.`id` = '37' limit 1
select * from `users` where `users`.`id` in (1)

    public function edit($id)
{
    try {
        // Find the fund with relationships
        $fund = Fund::with(['category', 'category.fundType'])->findOrFail($id);

        // Get all fund types
        $fundType = FundsType::all();

        // Get categories for the current fund type
        $fundCategory = FundsCategory::where('fund_type_id', $fund->category->fund_type_id)->get();
---
select * from `funds` where `funds`.`id` = '37' limit 1
select * from `funds_type`
select * from `funds_category` where `fund_type_id` = 1