Sprint_3/InitialProject/Project_2-master/app/Http/Controllers/FundController.php

select * from `funds`
select * from `users` where `users`.`id` in (161)
select * from `users` where `users`.`id` in (1, 161)
---
    public function index()
    {
        //$funds = Fund::latest()->paginate(5);
        $id = auth()->user()->id;
        if( auth()->user()->HasRole('admin') ){
            $funds = Fund::with('User')->get();
        }
        elseif( auth()->user()->HasRole('headproject') ){
            $funds = Fund::with('User')->get();

        }
        elseif( auth()->user()->HasRole('staff') ){
            $funds = Fund::with('User')->get();
        }
        else{
            $funds=User::find($id)->fund()->get();

select * from `users` where `users`.`id` = 1 limit 1
select * from `funds` where `funds`.`id` = 1 limit 1
---
    public function index()
    {
        if (auth()->user()->HasRole('admin')) {
            $funds = Fund::with(['category', 'fundType'])->latest()->get();
        } elseif (auth()->user()->HasRole('staff')) {
            $funds = Fund::with(['category', 'fundType'])->latest()->get();
        } else {
            $funds = User::find(auth()->id())
                ->fund()
                ->with(['category', 'fundType'])
                ->latest()
                ->get();