Sprint_3/InitialProject/Project_2-master/app/Http/Controllers/HomeController.php

select * from `highlights` where `selected` in (1, 2, 3) order by `selected` asc limit 3
select * from `papers` where `paper_yearpub` between 2009 and 2019 order by `paper_yearpub` desc
---
    public function index()
    {
<<<<<<< HEAD
        $latestHighlights = Highlight::whereIn('selected', [1, 2, 3])
                            ->orderBy('selected', 'asc')
                            ->take(3)
                            ->get();
=======
>>>>>>> Nantapong_1341
        //$papers = Paper::all()->orderBy, 'DESC');
        $papers = [];
        $year = range(Carbon::now()->year - 4, Carbon::now()->year);
        //$papers =Paper::orderBy('paper_yearpub', 'desc')->where('paper_yearpub', '=', 1)->get();
        $years = range(Carbon::now()->year, Carbon::now()->year - 5);

        $from = Carbon::now()->year - 16;
        $to = Carbon::now()->year - 6;
        // foreach ($years as $key => $value) {
        //     $papers[$value] = Paper::where('paper_yearpub', '=', $value)->orderBy('paper_yearpub', 'desc')->get();
        // }
        //return gettype($papers);

        // $p=Paper::with('author','teacher')->whereHas('teacher', function ($query) {
        //     return $query->select(['fname_en','lname_en']);
        // })->get();
        $p2 = Paper::with([
            'teacher' => function ($query) {
                $query->select(DB::raw("CONCAT(concat(left(fname_en,1),'.'),' ',lname_en) as full_name"))->addSelect('user_papers.author_type');
            },
            'author' => function ($query) {
                $query->select(DB::raw("CONCAT(concat(left(author_fname,1),'.'),' ',author_lname) as full_name"))->addSelect('author_of_papers.author_type');
            },

        ])->whereBetween('paper_yearpub', [$from, $to])->orderBy('paper_yearpub', 'desc')->get()->toArray();

select * from `papers` where `paper_yearpub` = 2025 order by `paper_yearpub` desc
---


        foreach ($years as $key => $value) {
            $p = Paper::with([
                'teacher' => function ($query) {
                    $query->select(DB::raw("CONCAT(concat(left(fname_en,1),'.'),' ',lname_en) as full_name"))->addSelect('user_papers.author_type');
                },
                'author' => function ($query) {
                    $query->select(DB::raw("CONCAT(concat(left(author_fname,1),'.'),' ',author_lname) as full_name"))->addSelect('author_of_papers.author_type');
                },

            ])->where('paper_yearpub', '=', $value)->orderBy('paper_yearpub', 'desc')->get()->toArray();

select count(*) as aggregate from `papers` where exists (select * from `source_data` inner join `source_papers` on `source_data`.`id` = `source_papers`.`source_data_id` where `papers`.`id` = `source_papers`.`paper_id` and `source_data_id` = 3) and `paper_type` in ('Conference Proceeding', 'Journal') and (paper_yearpub) = 2021
---
        $paper_wos = [];

        foreach ($year as $key => $value) {
            $paper_scopus[] = Paper::whereHas('source', function ($query) {
                return $query->where('source_data_id', '=', 1);
            })->whereIn('paper_type', ['Conference Proceeding', 'Journal'])
                ->where(DB::raw('(paper_yearpub)'), $value)->count();

select count(*) as aggregate from `papers` where exists (select * from `source_data` inner join `source_papers` on `source_data`.`id` = `source_papers`.`source_data_id` where `papers`.`id` = `source_papers`.`paper_id` and `source_data_id` = 2) and `paper_type` in ('Conference Proceeding', 'Journal') and (paper_yearpub) = 2021
---
        //return $paper_scopus;

        foreach ($year as $key => $value) {
            $paper_tci[] = Paper::whereHas('source', function ($query) {
                return $query->where('source_data_id', '=', 3);
            })->whereIn('paper_type', ['Conference Proceeding', 'Journal'])
                ->where(DB::raw('(paper_yearpub)'), $value)->count();

select count(*) as aggregate from `papers` where exists (select * from `source_data` inner join `source_papers` on `source_data`.`id` = `source_papers`.`source_data_id` where `papers`.`id` = `source_papers`.`paper_id` and `source_data_id` = 2) and `paper_type` in ('Conference Proceeding', 'Journal')
---
    public function getnum()
    {
        $paper_scopus = Paper::whereHas('source', function ($query) {
            return $query->where('source_data_id', '=', 1);
        })->whereIn('paper_type', ['Conference Proceeding', 'Journal'])->count();