Sprint_3/InitialProject/Project_2-master/app/Http/Controllers/ResearchProjectController.php

select * from `research_projects`
---
    public function index()
    {

        $id = auth()->user()->id;
        if (auth()->user()->HasRole('admin')) {
            $researchProjects = ResearchProject::with('User')->get();