Sprint_3/InitialProject/Project_2-master/app/Providers/AppServiceProvider.php

        function ($view) {
            $view->with('dn', \App\Models\Program::whereIn('degree_id', [1, 2, 3])->get());
---
select * from `programs` where `degree_id` in (1, 2, 3)